config.org
** Move files more intuitively
#+BEGIN_SRC emacs-lisp
  (defun move-file ()
    "Write this file to a new location, and delete the old one."
    (interactive)
    (let ((old-location (buffer-file-name)))
      (call-interactively #'write-file)
      (when old-location
        (delete-file old-location))))
#+END_SRC

** Insert a filename at point
#+BEGIN_SRC emacs-lisp
  (defun insert-filename ()
    (interactive)
    (insert (read-file-name "File:")))
#+END_SRC

** Insert a relative filename at point
#+BEGIN_SRC emacs-lisp
  (defun insert-relative-filename ()
    (interactive)
    (insert (file-relative-name (read-file-name "File: "))))
#+END_SRC

** Format long function parameter list into multiline
#+BEGIN_SRC emacs-lisp
  (defun format-function-parameters ()
    "Turn the list of function parameters into multiline."
    (interactive)
    (beginning-of-line)
    (search-forward "(" (line-end-position))
    (newline-and-indent)
    (while (search-forward "," (line-end-position) t)
      (newline-and-indent))
    (end-of-line)
    (c-hungry-delete-forward)
    (insert " ")
    (search-backward ")")
    (newline-and-indent))
#+END_SRC

** Eshell here
Thanks to Howard https://github.com/howardabrams/dot-files/blob/master/emacs-eshell.org
#+BEGIN_SRC emacs-lisp
  (defun eshell-here ()
    "Opens up a new shell in the directory associated with the
      current buffer's file. The eshell is renamed to match that
      directory to make multiple eshell windows easier."
    (interactive)
    (let* ((height (/ (window-total-height) 3)))
      (split-window-vertically (- height))
      (other-window 1)
      (eshell "new")
      (insert (concat "ls"))
      (eshell-send-input)))

  (bind-key "C-!" 'eshell-here)
#+END_SRC

** Show pwd relative to current project
And copy to clipboard
#+BEGIN_SRC emacs-lisp
  (defun relative-pwd ()
    (interactive)
    (let* ((prj (cdr (project-current)))
           (current-file buffer-file-truename)
           (prj-name (file-name-as-directory (file-name-nondirectory (directory-file-name prj))))
           (output (concat prj-name (file-relative-name current-file prj))))
      (kill-new output)
      (message output)))
#+END_SRC

** Add JIRA ticket number to commit messages
#+BEGIN_SRC emacs-lisp
  (add-hook 'git-commit-setup-hook
      '(lambda ()
          (let ((has-ticket-title (string-match "^[A-Z]+-[0-9]+"
                                      (magit-get-current-branch)))
                (words (s-split-words (magit-get-current-branch))))
            (if has-ticket-title
                (insert (format "[%s-%s] " (car words) (car (cdr words))))))))
#+END_SRC

** Create needed files for GPG
#+BEGIN_SRC emacs-lisp
  (with-temp-file "~/.gnupg/gpg.conf"
    (insert "use-agent\npinentry-mode loopback"))

  (with-temp-file "~/.gnupg/gpg-agent.conf"
    (insert "allow-loopback-pinentry"))

#+END_SRC

* Custom key bindings
** Quickly revert a buffer
Useful if file changed on disk
#+BEGIN_SRC emacs-lisp
  (define-key global-map (kbd "C-c r") 'revert-buffer)
#+END_SRC
** Quickly evaluate a buffer or a region
#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "C-c x") 'eval-buffer)
(define-key global-map (kbd "C-c X") 'eval-region)
#+END_SRC
** Use the Mac Style Home/End keys
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "<home>") 'beginning-of-buffer)
  (global-set-key (kbd "<end>") 'end-of-buffer)
#+END_SRC
** Quickly turn on auto-fill
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c q") 'auto-fill-mode)
#+END_SRC
** Comment the current line
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-;") 'comment-line)
#+END_SRC


* Org-Mode
** Set environment
   #+BEGIN_SRC emacs-lisp
     (use-package f)
     (use-package org)

     (setq org-agenda-files '("~/Essential/org/agenda.org"))

     (defun org-file-path (filename)
       "Return the absolute address of an org file, given its relative name."
       (concat (file-name-as-directory org-directory) filename))

     (defun org-find-file ()
       "Leverage Helm to quickly open any org files."
       (interactive)
      ( find-file (concat org-directory
                          (helm-comp-read "Select your org file: "
                                          (directory-files org-directory nil "\.org$")))))
   #+END_SRC
** =Ditaa= jar file to specific path
#+BEGIN_SRC bash
  sudo cp worg/code/scripts/ditaa.jar /usr/share/emacs/29.1/lisp/contrib/scripts
#+END_SRC

** Use syntax highlighting in source blocks while editing
   #+BEGIN_SRC emacs-lisp
   (setq org-src-fontify-natively t)
   #+END_SRC
** Use =org-mode= for =*.txt= files
   #+BEGIN_SRC emacs-lisp
   (add-to-list 'auto-mode-alist '("\\.txt\\'" . org-mode))
   (add-to-list 'auto-mode-alist '(".*/[0-9]*$" . org-mode))   ;; Journal entries
   #+END_SRC
** Set a dark background for source blocks
#+BEGIN_SRC emacs-lisp
  ;; (require 'color)
  ;; (if (display-graphic-p)
  ;;     (set-face-attribute 'org-block nil :background
  ;;                         (color-darken-name
  ;;                          (face-attribute 'default :background) 3)))

#+END_SRC
** Setup Org Agenda
   #+BEGIN_SRC emacs-lisp
   (define-key org-mode-map (kbd "C-c a") 'org-agenda)
   #+END_SRC
** Setup Org Capture
   #+BEGIN_SRC emacs-lisp
   (setq org-default-notes-file (concat org-directory "/notes.org"))
   (define-key global-map "\C-cc" 'org-capture)
   #+END_SRC
** Org Capture Templates
   #+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
   '(("t" "Tasks" entry
          (file+headline org-default-notes-file "Tasks")
          "* TODO %?\n %T\n %a")
     ("p" "Projects" entry
          (file+headline org-default-notes-file "Projects")
          "* %?\n ")
     ("e" "E-Learning" entry
          (file+headline org-default-notes-file "E-Learning")
          "* TODO %?\n %T\n %a")
     ("j" "Journal" entry
          (file+olp+datetree org-default-notes-file "Journal")
          "* %?\nEntered on %U\n %i\n")
     ("m" "Meeting Notes" entry
          (file+headline org-default-notes-file "Meeting Notes")
          "* %?\n ")
     ("s" "Scrum" entry
          (file+olp+datetree org-default-notes-file "Scrum")
          "* %?\n ")))
   #+END_SRC
** Set list of Tags
   #+BEGIN_SRC emacs-lisp
   (setq org-tag-alist '(("@work" . ?w)
                         ("@home" . ?h)
                         ("@event" . ?e)
                         ("project" . ?p)
                         ("study" . ?s)
                         ("planned" . ?x)
                         ("unplanned" . ?y)
                         ("2watch" . ?W)
                         ("laptop" . ?l)))
   #+END_SRC
** Shortcut keys to make it easier to edit text
   #+BEGIN_SRC emacs-lisp
   (defun org-text-bold () "Wraps the region with asterisks."
     (interactive)
     (surround-text "*"))
   (defun org-text-italics () "Wraps the region with slashes."
     (interactive)
     (surround-text "/"))
   (defun org-text-code () "Wraps the region with equal signs."
     (interactive)
     (surround-text "="))
   #+END_SRC
** Setup Meeting-Notes mode
   #+BEGIN_SRC emacs-lisp
   (defun meeting-notes ()
   "Call this after creating an org-mode heading for where the notes for the meeting
   should be. After calling this function, call 'meeting-done' to reset the environment."
       (interactive)
           (outline-mark-subtree)                              ;; Select org-mode section
           (narrow-to-region (region-beginning) (region-end))  ;; Only show that region
           (deactivate-mark)
           (delete-other-windows)                              ;; Get rid of other windows
           (text-scale-set 2)                                  ;; Text is now readable by others
           (fringe-mode 0)
           (message "When finished taking your notes, run meeting-done."))
   #+END_SRC
   #+BEGIN_SRC emacs-lisp
   (defun meeting-done ()
   "Attempt to 'undo' the effects of taking meeting notes."
       (interactive)
           (widen)                                       ;; Opposite of narrow-to-region
           (text-scale-set 0)                            ;; Reset the font size increase
           (fringe-mode 1)
           (winner-undo))                                ;; Put the windows back in place
   #+END_SRC
** KeyBindings for Meeting-Notes
  #+BEGIN_SRC emacs-lisp
  (define-key org-mode-map (kbd "C-c m o") 'meeting-notes)
  (define-key org-mode-map (kbd "C-c m d") 'meeting-done)
  #+END_SRC
