config.org
** Add more TODO keywords
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "STARTED(s!)" "|" "DONE(d!)" "WAITING(w@)" "CANCELLED(c@)")))
  (font-lock-add-keywords
    'org-mode `(("^\\*+ \\(TODO\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚑")
                          nil)))
               ("^\\*+ \\(STARTED\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚐")
                          nil)))
               ("^\\*+ \\(DONE\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "✔")
                          nil)))
                 ("^\\*+ \\(WAITING\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "⌛")
                          nil)))
               ("^\\*+ \\(CANCELLED\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "✘")
                          nil)))))
  ;; (setq org-todo-keyword-faces
  ;;            '(("WAIT" . "yellow")
  ;;              ("CANCELLED" . (:foreground "blue" :weight bold))))
#+END_SRC
** Enable =flyspell=
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook 'flyspell-mode)
  (add-hook 'text-mode-hook 'flyspell-mode)
#+END_SRC
** Setup =org-babel=
   Get additional languages?
   Load them all
#+BEGIN_SRC emacs-lisp
  (use-package ob-kotlin)
  (use-package ob-go)
  (use-package ob-rust)
  (use-package ob-clojurescript)
  (org-babel-do-load-languages
   (quote org-babel-load-languages)
   (quote ((emacs-lisp . t)
	   (dot . t)
	   (plantuml . t)
	   (python . t)
	   (gnuplot . t)
	   (shell . t)
	   (org . t)
	   (js . t)
	   (sql . t)
	   (awk . t)
	   (sed . t)
	   (ditaa . t)
	   (latex . t)
	   (go . t)
	   (rust . t)
	   (kotlin . t)
	   (clojurescript . t)
	   (haskell . t))))
#+END_SRC
** Enable =org-bullets=
   Make org files a bit more readable
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :config (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+END_SRC
** Display images inline
#+BEGIN_SRC emacs-lisp
  (setq org-startup-with-inline-images t)
#+END_SRC
** Register more exports
   #+BEGIN_SRC emacs-lisp
   (use-package ox-twbs)
   (require 'ox-md)
   (require 'ox-twbs)
   #+END_SRC
** Setup quick access to org files
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "<f5>") 'org-find-file)
#+END_SRC
** Use =org-journal=
#+BEGIN_SRC emacs-lisp
  (use-package org-journal
      :custom (org-journal-dir "~/Essential/org/journal" "Set journal location"))
#+END_SRC
** Presentations with =reveal.js=
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ox-reveal
    :config
      (require 'ox-reveal)
      (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
      (setq Org-Reveal-title-slide nil))
#+END_SRC
** Presentation with =org-present=
#+BEGIN_SRC emacs-lisp :tangle yes

  ;; ;; Install org-present if needed
  ;; (unless (package-installed-p 'org-present)
  ;;   (package-install 'org-present))

  ;; ;; Install visual-fill-column
  ;; (unless (package-installed-p 'visual-fill-column)
  ;;   (package-install 'visual-fill-column))


  ;; (defun my/org-present-prepare-slide (buffer-name heading)
  ;;   ;; Show only top-level headlines
  ;;   (org-overview)

  ;;   ;; Unfold the current entry
  ;;   (org-show-entry)

  ;;   ;; Show only direct subheadings of the slide but don't expand them
  ;;   (org-show-children))

  ;; (defun my/org-present-start ()
  ;;   ;; Configure fill width
  ;;   (setq visual-fill-column-width 110
  ;; 	visual-fill-column-center-text t)

  ;;   ;; Tweak font sizes
  ;;   (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
  ;; 				     (header-line (:height 4.0) variable-pitch)
  ;; 				     (org-document-title (:height 1.75) org-document-title)
  ;; 				     (org-code (:height 1.55) org-code)
  ;; 				     (org-verbatim (:height 1.55) org-verbatim)
  ;; 				     (org-block (:height 1.25) org-block)
  ;; 				     (org-block-begin-line (:height 0.7) org-block)))

  ;;   ;; Set a blank header line string to create blank space at the top
  ;;   (setq header-line-format " ")

  ;;   ;; Display inline images automatically
  ;;   (org-display-inline-images)

  ;;   ;; Center the presentation and wrap lines
  ;;   (visual-fill-column-mode 1)
  ;;   (visual-line-mode 1))

  ;; (defun my/org-present-end ()
  ;;   ;; Reset font customizations
  ;;   (setq-local face-remapping-alist '((default variable-pitch default)))

  ;;   ;; Clear the header line string so that it isn't displayed
  ;;   (setq header-line-format nil)

  ;;   ;; Stop displaying inline images
  ;;   (org-remove-inline-images)

  ;;   ;; Configure fill width
  ;;   (setq visual-fill-column-width -1
  ;; 	visual-fill-column-center-text -1)

  ;;   ;; Stop centering the document
  ;;   (visual-fill-column-mode -1)
  ;;   (visual-line-mode -1))


  ;; ;; Register hooks with org-present
  ;; (add-hook 'org-present-mode-hook 'my/org-present-start)
  ;; (add-hook 'org-present-mode-quit-hook 'my/org-present-end)
  ;; (add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide)


#+END_SRC
** Animate gif in org-mode
#+BEGIN_SRC emacs-lisp
(defun org-inline-image--get-current-image ()
  "Return the overlay associated with the image under point."
  (car (--select (eq (overlay-get it 'org-image-overlay) t) (overlays-at (point)))))

(defun org-inline-image--get (prop)
  "Return the value of property PROP for image under point."
  (let ((image (org-inline-image--get-current-image)))
    (when image
      (overlay-get image prop))))

(defun org-inline-image-animate ()
  "Animate the image if it's possible."
  (interactive)
  (let ((image-props (org-inline-image--get 'display)))
    (when (image-multi-frame-p image-props)
      (image-animate image-props))))

(defun org-inline-image-animate-auto ()
  (interactive)
  (when (eq 'org-mode major-mode)
    (while-no-input
      (run-with-idle-timer 0.3 nil 'org-inline-image-animate))))

(setq org-inline-image--get-current-image (byte-compile 'org-inline-image--get-current-image))
(setq org-inline-image-animate  (byte-compile 'org-inline-image-animate ))
(add-hook 'post-command-hook 'org-inline-image-animate-auto)
#+END_SRC
** Export HTML with =Htmlize=
   #+BEGIN_SRC emacs-lisp
   (use-package htmlize
     :config
       (require 'htmlize))

   #+END_SRC
** Preview Markdown with =grip-mode=
   #+BEGIN_SRC emacs-lisp
   (use-package grip-mode
     :ensure t
     :bind (:map markdown-mode-command-map
            ("g" . grip-mode)))
   #+END_SRC
** Github Flavored Markdown with =ox-gfm=
   #+BEGIN_SRC emacs-lisp
   (use-package ox-gfm)
   #+END_SRC
** HTML Preview
   #+BEGIN_SRC emacs-lisp
   (use-package org-preview-html)
   #+END_SRC

* Startup behavior
** Toggle fullscreen by default
#+BEGIN_SRC emacs-lisp
  (toggle-frame-maximized)
#+END_SRC
** Disable the big fat toolbars
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
#+END_SRC
** Disable the scroll bar
#+BEGIN_SRC emacs-lisp
(scroll-bar-mode -1)
#+END_SRC
** Disable splash screen
And set it in emacs-lisp mode
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
(setq initial-major-mode 'emacs-lisp-mode)
#+END_SRC
** Empty Scratch buffer
#+BEGIN_SRC emacs-lisp
(setq initial-scratch-message nil)
#+END_SRC
** Show xkcd comic of the day on start
Only on mac or Linux as windows support isn't there yet.
Disabled for now because too slow on start.
#+BEGIN_SRC emacs-lisp :tangle no
(cond
 ((string-equal system-type "darwin") ; Mac OS X
  (progn
    (showxkcd)))
 ((string-equal system-type "gnu/linux") ; linux
  (progn
    (showxkcd))))
#+END_SRC
** Disable all warnings except for emergency
#+BEGIN_SRC emacs-lisp :tangle no
  (setq warning-minimum-level :emergency)
#+END_SRC

* Window behavior
** Disable the bell
Awful atrocious noise on Windows
#+BEGIN_SRC emacs-lisp
(setq visible-bell 1)
#+END_SRC

** Adjust scrolling behavior
#+BEGIN_SRC emacs-lisp
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq auto-window-vscroll nil)
#+END_SRC

** Always ask for confirmation before quitting
#+BEGIN_SRC emacs-lisp
(setq confirm-kill-emacs 'y-or-n-p)
#+END_SRC

** Highlight the current line
#+BEGIN_SRC emacs-lisp
(when window-system
  (global-hl-line-mode))
#+END_SRC

** Use the back/forward mouse keys
#+BEGIN_SRC emacs-lisp
  (global-set-key [mouse-8] 'switch-to-prev-buffer)
  (global-set-key [mouse-9] 'switch-to-next-buffer)
#+END_SRC

** Enable line wrap
#+BEGIN_SRC emacs-lisp
  (setq-default visual-line-mode t)
  (add-hook 'visual-line-mode-hook 'visual-fill-column-mode)
  (global-set-key (kbd "C-x p") 'toggle-truncate-lines)
#+END_SRC

* Better defaults
Inspired from [[https://github.com/technomancy/better-defaults]]

** Replace dabbrev with hippie-expand
#+BEGIN_SRC emacs-lisp
  (use-package dabbrev
    :diminish abbrev-mode)
  (global-set-key (kbd "M-/") 'hippie-expand)
#+END_SRC

