config.el
  (setq org-todo-keywords
        '((sequence "TODO(t)" "STARTED(s!)" "|" "DONE(d!)" "WAITING(w@)" "CANCELLED(c@)")))
  (font-lock-add-keywords
    'org-mode `(("^\\*+ \\(TODO\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚑")
                          nil)))
               ("^\\*+ \\(STARTED\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚐")
                          nil)))
               ("^\\*+ \\(DONE\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "✔")
                          nil)))
                 ("^\\*+ \\(WAITING\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "⌛")
                          nil)))
               ("^\\*+ \\(CANCELLED\\) "
                (1 (progn (compose-region (match-beginning 1) (match-end 1) "✘")
                          nil)))))
  ;; (setq org-todo-keyword-faces
  ;;            '(("WAIT" . "yellow")
  ;;              ("CANCELLED" . (:foreground "blue" :weight bold))))
  (add-hook 'org-mode-hook 'flyspell-mode)
  (add-hook 'text-mode-hook 'flyspell-mode)
  (use-package ob-kotlin)
  (use-package ob-go)
  (use-package ob-rust)
  (use-package ob-clojurescript)
  (org-babel-do-load-languages
   (quote org-babel-load-languages)
   (quote ((emacs-lisp . t)
	   (dot . t)
	   (plantuml . t)
	   (python . t)
	   (gnuplot . t)
	   (shell . t)
	   (org . t)
	   (js . t)
	   (sql . t)
	   (awk . t)
	   (sed . t)
	   (ditaa . t)
	   (latex . t)
	   (go . t)
	   (rust . t)
	   (kotlin . t)
	   (clojurescript . t)
	   (haskell . t))))
  (use-package org-bullets
    :config (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
  (setq org-startup-with-inline-images t)
   (use-package ox-twbs)
   (require 'ox-md)
   (require 'ox-twbs)
  (global-set-key (kbd "<f5>") 'org-find-file)
  (use-package org-journal
      :custom (org-journal-dir "~/Essential/org/journal" "Set journal location"))
  (use-package ox-reveal
    :config
      (require 'ox-reveal)
      (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
      (setq Org-Reveal-title-slide nil))

  ;; ;; Install org-present if needed
  ;; (unless (package-installed-p 'org-present)
  ;;   (package-install 'org-present))

  ;; ;; Install visual-fill-column
  ;; (unless (package-installed-p 'visual-fill-column)
  ;;   (package-install 'visual-fill-column))


  ;; (defun my/org-present-prepare-slide (buffer-name heading)
  ;;   ;; Show only top-level headlines
  ;;   (org-overview)

  ;;   ;; Unfold the current entry
  ;;   (org-show-entry)

  ;;   ;; Show only direct subheadings of the slide but don't expand them
  ;;   (org-show-children))

  ;; (defun my/org-present-start ()
  ;;   ;; Configure fill width
  ;;   (setq visual-fill-column-width 110
  ;; 	visual-fill-column-center-text t)

  ;;   ;; Tweak font sizes
  ;;   (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
  ;; 				     (header-line (:height 4.0) variable-pitch)
  ;; 				     (org-document-title (:height 1.75) org-document-title)
  ;; 				     (org-code (:height 1.55) org-code)
  ;; 				     (org-verbatim (:height 1.55) org-verbatim)
  ;; 				     (org-block (:height 1.25) org-block)
  ;; 				     (org-block-begin-line (:height 0.7) org-block)))

  ;;   ;; Set a blank header line string to create blank space at the top
  ;;   (setq header-line-format " ")

  ;;   ;; Display inline images automatically
  ;;   (org-display-inline-images)

  ;;   ;; Center the presentation and wrap lines
  ;;   (visual-fill-column-mode 1)
  ;;   (visual-line-mode 1))

  ;; (defun my/org-present-end ()
  ;;   ;; Reset font customizations
  ;;   (setq-local face-remapping-alist '((default variable-pitch default)))

  ;;   ;; Clear the header line string so that it isn't displayed
  ;;   (setq header-line-format nil)

  ;;   ;; Stop displaying inline images
  ;;   (org-remove-inline-images)

  ;;   ;; Configure fill width
  ;;   (setq visual-fill-column-width -1
  ;; 	visual-fill-column-center-text -1)

  ;;   ;; Stop centering the document
  ;;   (visual-fill-column-mode -1)
  ;;   (visual-line-mode -1))


  ;; ;; Register hooks with org-present
  ;; (add-hook 'org-present-mode-hook 'my/org-present-start)
  ;; (add-hook 'org-present-mode-quit-hook 'my/org-present-end)
  ;; (add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide)


(defun org-inline-image--get-current-image ()
  "Return the overlay associated with the image under point."
  (car (--select (eq (overlay-get it 'org-image-overlay) t) (overlays-at (point)))))

(defun org-inline-image--get (prop)
  "Return the value of property PROP for image under point."
  (let ((image (org-inline-image--get-current-image)))
    (when image
      (overlay-get image prop))))

(defun org-inline-image-animate ()
  "Animate the image if it's possible."
  (interactive)
  (let ((image-props (org-inline-image--get 'display)))
    (when (image-multi-frame-p image-props)
      (image-animate image-props))))

(defun org-inline-image-animate-auto ()
  (interactive)
  (when (eq 'org-mode major-mode)
    (while-no-input
      (run-with-idle-timer 0.3 nil 'org-inline-image-animate))))

(setq org-inline-image--get-current-image (byte-compile 'org-inline-image--get-current-image))
(setq org-inline-image-animate  (byte-compile 'org-inline-image-animate ))
(add-hook 'post-command-hook 'org-inline-image-animate-auto)
   (use-package htmlize
     :config
       (require 'htmlize))

   (use-package grip-mode
     :ensure t
     :bind (:map markdown-mode-command-map
            ("g" . grip-mode)))
   (use-package ox-gfm)
   (use-package org-preview-html)
  (toggle-frame-maximized)
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-startup-message t)
(setq initial-major-mode 'emacs-lisp-mode)
(setq initial-scratch-message nil)
(setq visible-bell 1)
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq auto-window-vscroll nil)
(setq confirm-kill-emacs 'y-or-n-p)
(when window-system
  (global-hl-line-mode))
  (global-set-key [mouse-8] 'switch-to-prev-buffer)
  (global-set-key [mouse-9] 'switch-to-next-buffer)
  (setq-default visual-line-mode t)
  (add-hook 'visual-line-mode-hook 'visual-fill-column-mode)
  (global-set-key (kbd "C-x p") 'toggle-truncate-lines)
  (use-package dabbrev
    :diminish abbrev-mode)
  (global-set-key (kbd "M-/") 'hippie-expand)
(use-package ivy
  :config
    (ivy-mode 1)
