config.el
    (setq ivy-use-virtual-buffers t)
    (setq enable-recursive-minibuffers t)
    (global-set-key (kbd "C-c C-r") 'ivy-resume)
    (global-set-key (kbd "<f6>") 'ivy-resume))
(use-package swiper
  :config (global-set-key "\C-s" 'swiper))
  (use-package counsel
    :config
      ;; (global-set-key (kbd "M-x") 'counsel-M-x)
      (global-set-key (kbd "C-x C-f") 'counsel-find-file)
      (global-set-key (kbd "<f1> f") 'counsel-describe-function)
      (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
      (global-set-key (kbd "<f1> l") 'counsel-find-library)
      (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
      (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
      ;; (global-set-key (kbd "C-c g") 'counsel-git)
      ;; (global-set-key (kbd "C-c j") 'counsel-git-grep)
      ;; (global-set-key (kbd "C-c k") 'counsel-ag)
      ;; (global-set-key (kbd "C-x l") 'counsel-locate)
      ;; (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
      (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history))
   (use-package smex
     :ensure t
     :bind (("M-x" . smex))
     :config (smex-initialize))
(setq backup-directory-alist `(("." . ,(concat user-emacs-directory
                                               "backups"))))
(fset 'yes-or-no-p 'y-or-n-p)
(setq tags-revert-without-query 1)
  (put 'narrow-to-region 'disabled nil)
  ;; (use-package solarized-theme
  ;;   :config (load-theme 'solarized-dark t))

   ;; (use-package doom-themes
   ;;  :config
   ;;  ;; Global settings (defaults)
   ;;  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
   ;;    doom-themes-enable-italic t) ; if nil, italics is universally disabled
   ;;  (load-theme 'doom-solarized-dark t)

   ;;   ;; Enable flashing mode-line on errors
   ;;  (doom-themes-visual-bell-config))


   ;; Let the desktop background show through
  ;; (set-frame-parameter (selected-frame) 'alpha '(97 . 100))
  ;; (add-to-list 'default-frame-alist '(alpha . (90 . 90)))

     ;; Enable custom neotree theme (all-the-icons must be installed!)
  ;;   (doom-themes-neotree-config)
  ;;    ;; or for treemacs users
  ;;   ;; (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  ;;   ;; (doom-themes-treemacs-config)

  ;;    ;; Corrects (and improves) org-mode's native fontification.
  ;;   (doom-themes-org-config)

   ;; (use-package spacemacs-common

   ;;   :ensure spacemacs-theme
   ;;   :config (load-theme 'spacemacs-dark t))
   ;; REMEMBER TO SET THIS COLOR ON THE `spacemacs-common.el` FILE, REPLACE `#2aa1ae' WITH `#626262`
   ;; (custom-set-variables '(spacemacs-theme-custom-colors
   ;;                       '((comment . "#626262"))))


   ;; (use-package foggy-night-theme
   ;;     :config (load-theme 'foggy-night t))


   ;; ;
					  ; (use-package color-theme-sanityinc-tomorrow
   ;;   :config (load-theme 'sanityinc-tomorrow-eighties t))

   ;; (use-package dracula-theme
   ;;   :config (load-theme 'dracula t))

   ;; (use-package spacegray-theme
   ;;   :config (load-theme 'spacegray t))

   (use-package gruvbox-theme
     :config (load-theme 'gruvbox-dark-hard t))

   ;; (use-package afternoon-theme
   ;;   :config (load-theme 'afternoon t))

  ;; https://github.com/domtronn/all-the-icons.el
  (use-package all-the-icons
    :custom
    (all-the-icons-install-fonts))
  (use-package all-the-icons-gnus)
  (use-package all-the-icons-ivy-rich)
  (use-package all-the-icons-ibuffer)
  (use-package all-the-icons-dired)
  (use-package all-the-icons-completion)
  (use-package treemacs-all-the-icons)
  (setq-default mode-line-format '("%e"
                                   mode-line-front-space
                                   " "
                                   mode-line-modified
                                   " "
                                   "%[" mode-line-buffer-identification "%]"
                                   "   "
                                   "L%l"
                                   "  "
                                   "C%c"
                                   " "
                                   mode-line-modes
                                   mode-line-misc-info
                                   projectile-mode-line
                                   " "
                                   (vc-mode vc-mode)
                                   mode-line-end-spaces))
  (use-package minions
    :config (minions-mode 1))
    ;; (if (condition-case nil
    ;;     (x-list-fonts "Hack")
    ;;   (error nil))
    ;;     (progn
    ;;   (add-to-list 'default-frame-alist '(font . "Hack-13"))
    ;;   (set-face-attribute 'default nil :font "Hack-13")))

  ;; ;; Set reusable font name variables
  (defvar my/fixed-width-font "JetBrains Mono"
    "The font to use for monospaced (fixed width) text.")

  (defvar my/variable-width-font "Iosevka"
    "The font to use for variable-pitch (document) text.")

  ;; NOTE: These settings might not be ideal for your machine, tweak them as needed!
  (set-face-attribute 'default nil :font my/fixed-width-font :weight 'regular :height 110)
  (set-face-attribute 'fixed-pitch nil :font my/fixed-width-font :weight 'regular :height 130)
  (set-face-attribute 'variable-pitch nil :font my/variable-width-font :weight 'light :height 140)

(if (eq system-type 'windows-nt)
    (progn
      (setenv "PATH" (concat "C:\\cygwin64\\bin\\"
                             path-separator
                             (getenv "PATH")))
      )
  (progn
    (use-package exec-path-from-shell
      :config (exec-path-from-shell-copy-env "PATH"))
    )
  )
       (use-package vterm)
       (use-package multi-vterm)
  (use-package yasnippet
    :diminish yas-minor-mode
    :config (yas-global-mode 1))
  (use-package org-sync-snippets
    :config (setq org-sync-snippets-org-snippets-file
                  (concat (file-name-as-directory config-load-path) "snippets.org")))
  (use-package smart-tabs-mode
    :commands (smart-tabs-mode)
    :init
    (add-hook 'c-mode-common-hook #'smart-tabs-mode)
    :config
    (smart-tabs-advice c-indent-line     c-basic-offset)
    (smart-tabs-advice c-indent-region   c-basic-offset))

  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (setq tab-width 4)
  (setq tab-stop-list '(2 4 8 12 16 20 24 28 32 36 40 44 48 52 56 60 64 68 72 76 80))

(setq require-final-newline t)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
  (setq-default buffer-file-coding-system 'utf-8-unix)
  (setq-default default-buffer-file-coding-system 'utf-8-unix)
  (set-default-coding-systems 'utf-8-unix)
  (prefer-coding-system 'utf-8-unix)
