config.el
  ;; (defvar yank-indent-modes '(php-mode js2-mode)
  ;;   "Modes in which to indent regions that are yanked (or yank-popped)")

  ;; (defvar yank-advised-indent-threshold 1000
  ;;   "Threshold (# chars) over which indentation does not automatically occur.")

  ;; (defun yank-advised-indent-function (beg end)
  ;;   "Do indentation, as long as the region isn't too large."
  ;;   (if (<= (- end beg) yank-advised-indent-threshold)
  ;;       (indent-region beg end nil)))

  ;; (defadvice yank (after yank-indent activate)
  ;;   "If current mode is one of 'yank-indent-modes, indent yanked text (with prefix arg don't indent)."
  ;;   (if (and (not (ad-get-arg 0))
  ;;            (--any? (derived-mode-p it) yank-indent-modes))
  ;;       (let ((transient-mark-mode nil))
  ;;         (yank-advised-indent-function (region-beginning) (region-end)))))

  ;; (defadvice yank-pop (after yank-pop-indent activate)
  ;;   "If current mode is one of 'yank-indent-modes, indent yanked text (with prefix arg don't indent)."
  ;;   (if (and (not (ad-get-arg 0))
  ;;            (member major-mode yank-indent-modes))
  ;;       (let ((transient-mark-mode nil))
  ;;         (yank-advised-indent-function (region-beginning) (region-end)))))

  ;; (defun yank-unindented ()
  ;;   (interactive)
  ;;   (yank 1))
  (setq comment-start "#")
  (use-package prog-fill
    :bind (("M-q" . prog-fill)))
(show-paren-mode)
(electric-pair-mode)
  (use-package paradox
    :custom
    (paradox-execute-asynchronously t)
    :config
    (paradox-enable))
  (use-package avy
    :bind (("C-c SPC" . avy-goto-char-2)
           ("M-g f" . avy-goto-line)
           ("M-g w" . avy-goto-word-1)))
  ;; (windmove-default-keybindings)

  (global-set-key (kbd "S-<left>")  'windmove-left)
  (global-set-key (kbd "S-<right>") 'windmove-right)
  (global-set-key (kbd "S-<up>")    'windmove-up)
  (global-set-key (kbd "S-<down>")  'windmove-down)
(use-package which-key
  :diminish which-key-mode
  :config (which-key-mode 1))
(winner-mode 1)
(use-package smooth-scrolling
  :config
  (smooth-scrolling-mode 1)
  (setq smooth-scroll-margin 5))
(use-package neotree)
(use-package ibuffer-vc)
(use-package ibuffer-git)
(define-key global-map (kbd "C-x C-b") 'ibuffer)
(use-package yascroll
  :config (global-yascroll-bar-mode 1))
(use-package minimap
  :config
  (setq minimap-window-location "right")
  (setq minimap-major-modes '(prog-mode org-mode)))
  (use-package rotate
    :config (global-set-key (kbd "C-|") 'rotate-layout))
(use-package anzu
  :config (global-anzu-mode +1)
          (setq anzu-mode-lighter ""))
  (use-package hamburger-menu
    :config (setq mode-line-front-space 'hamburger-menu-mode-line))
  (define-globalized-minor-mode global-hs-minor-mode
  hs-minor-mode hs-minor-mode)
  (global-hs-minor-mode 1)
  (global-set-key (kbd "C-c h s") 'hs-show-all)
  (global-set-key (kbd "C-c h a") 'hs-hide-all)
  (global-set-key (kbd "C-c h g") 'hs-toggle-hiding)
  (use-package eyebrowse
    :config (eyebrowse-mode t))
(use-package multiple-cursors
  :bind (("C-S-c C-S-c" . mc/edit-lines)
         ("C->" . mc/mark-next-like-this)
         ("C-<" . mc/mark-previous-like-this)
         ("C-c C-<" . mc/mark-all-like-this)
         ("C-S-<mouse-1>" . mc/add-cursor-on-click)))
(use-package zzz-to-char
  :bind ("M-z" . zzz-up-to-char))
  (use-package whole-line-or-region
    :diminish whole-line-or-region-global-mode
    :config (whole-line-or-region-global-mode t))
  (use-package viking-mode
    :diminish viking-mode
    :config
    (viking-global-mode)
    (setq viking-greedy-kill nil)
    (setq viking-enable-region-kill t)
    (setq viking-kill-functions (list '(lambda()
                                         (if (region-active-p)
                                             (kill-region (region-beginning) (region-end))
                                         (delete-char 1 t)))
                                      '(lambda()
                                         (insert (pop kill-ring)) ;; insert the char back
                                         (kill-new "") ;; start a new entry in the kill-ring
                                         (viking-kill-word)
                                         (kill-append " " nil)) ;; append the extra space
                                      'viking-kill-line-from-point
                                      'viking-kill-line
                                      'viking-kill-paragraph
                                      'viking-kill-buffer)))
  ;; (use-package undo-tree
  ;;   :diminish undo-tree-mode
  ;;   :config
  ;;   (global-undo-tree-mode t)
  ;;   (setq undo-tree-visualizer-diff t))
  (use-package volatile-highlights
    :diminish volatile-highlights-mode
    :config
    (vhl/define-extension 'undo-tree 'undo-tree-yank 'undo-tree-move)
    (vhl/install-extension 'undo-tree)
    (volatile-highlights-mode t))
(use-package ciel
  :bind (("C-c i" . ciel-ci)
         ("C-c o" . ciel-co)))
  (use-package fancy-narrow
    :diminish fancy-narrow-mode)
  (use-package ag)
  (use-package helm-ag)
  (setq projectile-go-function nil) ;; temporary workaround
  (use-package projectile
    :config
    (projectile-mode)
    (setq-default projectile-mode-line
     '(:eval
       (if (file-remote-p default-directory)
           " Proj"
         (format " Proj[%s]" (projectile-project-name)))))
    (add-to-list 'projectile-globally-ignored-directories "node_modules"))
(use-package helm-projectile
  :bind (("C-c v" . helm-projectile)
         ("C-c C-v" . helm-projectile-ag)
         ("C-c w" . helm-projectile-switch-project)))
(use-package company
  :ensure
  :custom
  (company-idle-delay 0.5) ;; how long to wait until popup
  ;; (company-begin-commands nil) ;; uncomment to disable popup
  :bind
  (:map company-active-map
	      ("C-n". company-select-next)
	      ("C-p". company-select-previous)
	      ("M-<". company-select-first)
	      ("M->". company-select-last)))

(use-package yasnippet
  :ensure
  :config
  (yas-reload-all)
  (add-hook 'prog-mode-hook 'yas-minor-mode)
  (add-hook 'text-mode-hook 'yas-minor-mode))

  ;; (use-package company
  ;;   :diminish company-mode
  ;;   :config
  ;;   (add-hook 'after-init-hook 'global-company-mode)
  ;;   (setq company-minimum-prefix-length 2)
  ;;   (setq company-dabbrev-downcase nil))
  ;; (use-package company-go)
;;  (use-package flycheck
