config.org
** Enable =flycheck=
#+BEGIN_SRC emacs-lisp
;;  (use-package flycheck
;;    :diminish flycheck-mode
;;    :config (flycheck-mode 1)
;;    (setq flycheck-phpcs-standard "PSR2")
;;    (add-hook 'python-mode-hook 'flycheck-mode)
;;    (add-hook 'emacs-lisp-mode-hook 'flycheck-mode)
;;    (add-hook 'json-mode-hook 'flycheck-mode)
;;    (add-hook 'rjsx-mode-hook 'flycheck-mode))
#+END_SRC

Add a little helm twist to it
#+BEGIN_SRC emacs-lisp
(use-package helm-flycheck
  :bind ("C-c f" . helm-flycheck))
#+END_SRC

** Enable =electric-operator=
And add a couple of rules for PHP and JS
#+BEGIN_SRC emacs-lisp
  (use-package electric-operator
    :config
    (electric-operator-add-rules-for-mode 'php-mode
                                          (cons " - >" "->"))
    (electric-operator-add-rules-for-mode 'php-mode
                                          (cons " / /" "// "))
    (electric-operator-add-rules-for-mode 'php-mode
                                          (cons " = > " " => "))
    (electric-operator-add-rules-for-mode 'php-mode
                                          (cons " < ?" "<?"))
    (electric-operator-add-rules-for-mode 'js2-mode
                                          (cons " = > " " => "))
    (electric-operator-add-rules-for-mode 'js2-jsx-mode
                                          (cons " = > " " => "))
    (electric-operator-add-rules-for-mode 'rjsx-mode
                                          (cons " = > " " => ")))
#+END_SRC

** Enable =dumb-jump=
Great package to jump to definition
#+BEGIN_SRC emacs-lisp
  (use-package dumb-jump
    :config (setq dumb-jump-aggressive nil))
#+END_SRC

** Enable =highlight-numbers=
Make numbers in source code more noticeable
#+BEGIN_SRC emacs-lisp
  (use-package highlight-numbers
    :config (add-hook 'prog-mode-hook 'highlight-numbers-mode))
#+END_SRC
** Show column numbers
    #+BEGIN_SRC emacs-lisp
    (setq column-number-mode t)
    #+END_SRC
** Highlight line
    #+BEGIN_SRC emacs-lisp
    (setq global-hl-line-mode t)
    #+END_SRC
** Highlight indentations
    #+BEGIN_SRC emacs-lisp
      ;; https://github.com/DarthFennec/highlight-indent-guides
      (use-package highlight-indent-guides
        :config
        (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
        (set-face-background 'highlight-indent-guides-odd-face "darkgray")
        (set-face-background 'highlight-indent-guides-even-face "dimgray")
        (set-face-foreground 'highlight-indent-guides-character-face "dimgray")
        (setq highlight-indent-guides-method 'fill))

    #+END_SRC
** Show line numbers
    #+BEGIN_SRC emacs-lisp
      (setq global-display-line-numbers-mode t)
      ;; (setq linum-format "%d ")
    #+END_SRC

* Emacs Lisp
** Enable =eldoc=
#+BEGIN_SRC emacs-lisp
  (use-package eldoc
    :diminish eldoc-mode
    :config (add-hook 'emacs-lisp-mode-hook 'eldoc-mode))
#+END_SRC
** Enable =rainbow-delimiters=
But only for emacs-lisp
#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :config
  (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode))
#+END_SRC
** Enable =paredit=
#+BEGIN_SRC emacs-lisp
(use-package paredit
  :config
  (add-hook 'emacs-lisp-mode-hook 'paredit-mode))
#+END_SRC
** Enable =eros=
#+BEGIN_SRC emacs-lisp
  (use-package eros
    :config (add-hook 'emacs-lisp-mode-hook 'eros-mode))
#+END_SRC
** Enable =simple-call-tree=
#+BEGIN_SRC emacs-lisp
  (use-package simple-call-tree)
#+END_SRC
** Enable =suggest=
#+BEGIN_SRC emacs-lisp
  (use-package suggest)
#+END_SRC


* lsp-mode
We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak
the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]]
so that you can learn which language servers are available and how to install them.
The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.
I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.
The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just
by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+BEGIN_SRC emacs-lisp

  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))

#+END_SRC

* lsp-UI
[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+BEGIN_SRC emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+END_SRC

* lsp-treemacs
[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol,
or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+BEGIN_SRC emacs-lisp

  (use-package lsp-treemacs
    :after lsp)

#+END_SRC

* Debugging with dap-mode
[[https://emacs-lsp.github.io/dap-mode/][dap-mode]] is an excellent package for bringing rich debugging capabilities to Emacs via the [[https://microsoft.github.io/debug-adapter-protocol/][Debug Adapter Protocol]].
You should check out the [[https://emacs-lsp.github.io/dap-mode/page/configuration/][configuration docs]] to learn how to configure the debugger for your language.
Also make sure to check out the documentation for the debug adapter to see what configuration parameters are available to use for your debug templates!

#+BEGIN_SRC emacs-lisp
  (use-package dap-mode)
    ;; (use-package dap-mode
    ;;   ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;;   ;; :custom
    ;;   ;; (lsp-enable-dap-auto-configure nil)
    ;;   ;; :config
    ;;   ;; (dap-ui-mode 1)

    ;;   ;; :config
    ;;   ;; ;; Set up Node debugging
    ;;   ;; (dap-node-setup) ;; Automatically installs Node debug adapter if needed

    ;;   ;; Bind `C-c l d` to `dap-hydra` for easy access
    ;;   (general-define-key
    ;;     :keymaps 'lsp-mode-map
    ;;     :prefix lsp-keymap-prefix
    ;;     "d" '(dap-hydra t :wk "debugger")))


#+END_SRC


* LaTex Mode
#+BEGIN_SRC emacs-lisp
  ;; (add-hook 'LaTeX-mode-hook #'latex-extra-mode)
  ;; (use-package magic-latex-buffer)
  ;; (add-hook 'latex-mode-hook 'magic-latex-buffer)
#+END_SRC

* Logs
** Turn on =auto-revert-tail-mode= for log files
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.log\\'" . auto-revert-tail-mode))
#+END_SRC

* Dired
** Enable =dired-x=
#+BEGIN_SRC emacs-lisp
  (require 'dired-x)
#+END_SRC
** Use human-readable sizes
#+BEGIN_SRC emacs-lisp
  (setq dired-listing-switches "-alh")
#+END_SRC

* YAML
** Enable =yaml-mode=
#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :config
    (add-hook 'yaml-mode-hook 'flycheck-mode)
    (add-hook 'yaml-mode-hook 'flyspell-mode))
#+END_SRC

** Enable =flycheck-yamllint=
#+BEGIN_SRC emacs-lisp
  (use-package flycheck-yamllint)
#+END_SRC

* Restclient
** Setup =restclient=
#+BEGIN_SRC emacs-lisp
  (use-package restclient
    :mode ("\\.restclient\\'" . restclient-mode))
#+END_SRC
** Enable =company-restclient=
#+BEGIN_SRC emacs-lisp
  (use-package company-restclient
    :config (add-to-list 'company-backends 'company-restclient))
#+END_SRC
** Integrate to =org-mode=
#+BEGIN_SRC emacs-lisp
  (use-package ob-restclient)
#+END_SRC

* PlantUML
** Enable =plantuml-mode=
#+BEGIN_SRC emacs-lisp
  (use-package plantuml-mode)
#+END_SRC
** Download and hook up plantuml.jar
#+BEGIN_SRC emacs-lisp
  (let ((plantuml-directory (concat config-load-path "extra/"))
        (plantuml-link "https://superb-dca2.dl.sourceforge.net/project/plantuml/plantuml.jar"))
    (let ((plantuml-target (concat plantuml-directory "plantuml.jar")))
      (if (not (f-exists? plantuml-target))
          (progn (message "Downloading plantuml.jar")
                 (shell-command
                  (mapconcat 'identity (list "wget" plantuml-link "-O" plantuml-target) " "))
                 (kill-buffer "*Shell Command Output*")))
      (setq org-plantuml-jar-path plantuml-target)))
#+END_SRC
* Extra Packages
No need to configure, just handy to have.
#+BEGIN_SRC emacs-lisp
  (use-package 2048-game)
  (use-package isend-mode)
  (use-package lorem-ipsum)
  (use-package markdown-mode)
  (use-package pdf-tools
    :defer t)
  (use-package refine)
  (use-package request)
  (use-package csv-mode)
  ;; (use-package csharp-mode)
  (use-package keychain-environment)
  (use-package prodigy)
  (use-package vlf)
  (use-package helm-flyspell)
#+END_SRC

* Extra file loading
If I am working on a separate library, I like to have it loaded on start.
Just need to place it in the extra folder.
#+BEGIN_SRC emacs-lisp
  (use-package load-dir
    :config (setq load-dirs (concat config-load-path "extra/")))
#+END_SRC

* Key Frequency
Trying the =keyfreq= package to monitor my command usage
#+BEGIN_SRC emacs-lisp
  (use-package keyfreq
    :config
    (keyfreq-mode 1)
    (keyfreq-autosave-mode 1))
#+END_SRC

