config.el
;;    :diminish flycheck-mode
;;    :config (flycheck-mode 1)
;;    (setq flycheck-phpcs-standard "PSR2")
;;    (add-hook 'python-mode-hook 'flycheck-mode)
;;    (add-hook 'emacs-lisp-mode-hook 'flycheck-mode)
;;    (add-hook 'json-mode-hook 'flycheck-mode)
;;    (add-hook 'rjsx-mode-hook 'flycheck-mode))
(use-package helm-flycheck
  :bind ("C-c f" . helm-flycheck))
  (use-package electric-operator
    :config
    (electric-operator-add-rules-for-mode 'php-mode
                                          (cons " - >" "->"))
    (electric-operator-add-rules-for-mode 'php-mode
                                          (cons " / /" "// "))
    (electric-operator-add-rules-for-mode 'php-mode
                                          (cons " = > " " => "))
    (electric-operator-add-rules-for-mode 'php-mode
                                          (cons " < ?" "<?"))
    (electric-operator-add-rules-for-mode 'js2-mode
                                          (cons " = > " " => "))
    (electric-operator-add-rules-for-mode 'js2-jsx-mode
                                          (cons " = > " " => "))
    (electric-operator-add-rules-for-mode 'rjsx-mode
                                          (cons " = > " " => ")))
  (use-package dumb-jump
    :config (setq dumb-jump-aggressive nil))
  (use-package highlight-numbers
    :config (add-hook 'prog-mode-hook 'highlight-numbers-mode))
    (setq column-number-mode t)
    (setq global-hl-line-mode t)
      ;; https://github.com/DarthFennec/highlight-indent-guides
      (use-package highlight-indent-guides
        :config
        (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
        (set-face-background 'highlight-indent-guides-odd-face "darkgray")
        (set-face-background 'highlight-indent-guides-even-face "dimgray")
        (set-face-foreground 'highlight-indent-guides-character-face "dimgray")
        (setq highlight-indent-guides-method 'fill))

      (setq global-display-line-numbers-mode t)
      ;; (setq linum-format "%d ")
  (use-package eldoc
    :diminish eldoc-mode
    :config (add-hook 'emacs-lisp-mode-hook 'eldoc-mode))
(use-package rainbow-delimiters
  :config
  (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode))
(use-package paredit
  :config
  (add-hook 'emacs-lisp-mode-hook 'paredit-mode))
  (use-package eros
    :config (add-hook 'emacs-lisp-mode-hook 'eros-mode))
  (use-package simple-call-tree)
  (use-package suggest)

  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))


  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))


  (use-package lsp-treemacs
    :after lsp)

  (use-package dap-mode)
    ;; (use-package dap-mode
    ;;   ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;;   ;; :custom
    ;;   ;; (lsp-enable-dap-auto-configure nil)
    ;;   ;; :config
    ;;   ;; (dap-ui-mode 1)

    ;;   ;; :config
    ;;   ;; ;; Set up Node debugging
    ;;   ;; (dap-node-setup) ;; Automatically installs Node debug adapter if needed

    ;;   ;; Bind `C-c l d` to `dap-hydra` for easy access
    ;;   (general-define-key
    ;;     :keymaps 'lsp-mode-map
    ;;     :prefix lsp-keymap-prefix
    ;;     "d" '(dap-hydra t :wk "debugger")))


  ;; (add-hook 'LaTeX-mode-hook #'latex-extra-mode)
  ;; (use-package magic-latex-buffer)
  ;; (add-hook 'latex-mode-hook 'magic-latex-buffer)
  (add-to-list 'auto-mode-alist '("\\.log\\'" . auto-revert-tail-mode))
  (require 'dired-x)
  (setq dired-listing-switches "-alh")
  (use-package yaml-mode
    :config
    (add-hook 'yaml-mode-hook 'flycheck-mode)
    (add-hook 'yaml-mode-hook 'flyspell-mode))
  (use-package flycheck-yamllint)
  (use-package restclient
    :mode ("\\.restclient\\'" . restclient-mode))
  (use-package company-restclient
    :config (add-to-list 'company-backends 'company-restclient))
  (use-package ob-restclient)
  (use-package plantuml-mode)
  (let ((plantuml-directory (concat config-load-path "extra/"))
        (plantuml-link "https://superb-dca2.dl.sourceforge.net/project/plantuml/plantuml.jar"))
    (let ((plantuml-target (concat plantuml-directory "plantuml.jar")))
      (if (not (f-exists? plantuml-target))
          (progn (message "Downloading plantuml.jar")
                 (shell-command
                  (mapconcat 'identity (list "wget" plantuml-link "-O" plantuml-target) " "))
                 (kill-buffer "*Shell Command Output*")))
      (setq org-plantuml-jar-path plantuml-target)))
  (use-package 2048-game)
  (use-package isend-mode)
  (use-package lorem-ipsum)
  (use-package markdown-mode)
  (use-package pdf-tools
    :defer t)
  (use-package refine)
  (use-package request)
  (use-package csv-mode)
  ;; (use-package csharp-mode)
  (use-package keychain-environment)
  (use-package prodigy)
  (use-package vlf)
  (use-package helm-flyspell)
  (use-package load-dir
    :config (setq load-dirs (concat config-load-path "extra/")))
  (use-package keyfreq
    :config
    (keyfreq-mode 1)
    (keyfreq-autosave-mode 1))

  (use-package f3
