config.org
* Eshell
Customize eshall
#+BEGIN_SRC emacs-lisp

  (use-package f3
    :config  (setq eshell-visual-commands
             '("less" "tmux" "htop" "top" "bash" "zsh" "fish"))

             (setq eshell-visual-subcommands
             '(("git" "log" "l" "diff" "show")))

             ;; Prompt with a bit of help from http://www.emacswiki.org/emacs/EshellPrompt
             (defmacro with-face (str &rest properties)
             `(propertize ,str 'face (list ,@properties)))

             (defun eshell/abbr-pwd ()
                (let ((home (getenv "HOME"))
                    (path (eshell/pwd)))
                (cond
                    ((string-equal home path) "~")
                    ((f-ancestor-of? home path) (concat "~/" (f-relative path home)))
                    (path))))

             (defun eshell/my-prompt ()
                 (let ((header-bg "#161616"))
                    (concat
                        (with-face (eshell/abbr-pwd) :foreground "#008700")
                    (if (= (user-uid) 0)
                        (with-face "#" :foreground "red")
                        (with-face "$" :foreground "#2345ba"))
                        " ")))
             (setq eshell-prompt-function 'eshell/my-prompt)
             (setq eshell-highlight-prompt nil)
             (setq eshell-prompt-regexp "^[^#$\n]+[#$] ")
             (setq eshell-cmpl-cycle-completions nil))
#+END_SRC


* Kubernetes
#+BEGIN_SRC emacs-lisp
(use-package kubernetes
  :ensure t
  :commands (kubernetes-overview)
  :config
  (setq kubernetes-poll-frequency 3600
        kubernetes-redraw-frequency 3600))
#+END_SRC

* Terraform
#+BEGIN_SRC emacs-lisp
  (use-package terraform-mode
    :config
    (defun my-terraform-mode-init ()
      if you want to use outline-minor-mode
      (outline-minor-mode 1))

    (add-hook 'terraform-mode-hook 'my-terraform-mode-init))

  ;; terraform-ls is requered
  ;; https://github.com/hashicorp/terraform-ls
  (use-package lsp-mode
    :ensure t
    :hook (terraform-mode . lsp-deferred)
    :commands (lsp lsp-deferred)
    :custom
    (lsp-disabled-clients '(tfls))
    (lsp-terraform-ls-prefill-required-fields t)
    (lsp-terraform-ls-enable-show-reference t)
    (lsp-semantic-tokens-enable t)
    (lsp-semantic-tokens-honor-refresh-requests t)
    (lsp-enable-links t))

#+END_SRC

* Docker
** Setup =Dockerfile-mode=
#+BEGIN_SRC emacs-lisp
  (use-package dockerfile-mode
    :mode "Dockerfile\\'")
#+END_SRC

** Setup =Docker-Compose=
#+BEGIN_SRC emacs-lisp
  (use-package docker-compose-mode
    :mode "docker-compose\\'")
#+END_SRC

* Rego (Open Policy Agent Language)
#+BEGIN_SRC shell :tangle no
  curl -L -o opa https://openpolicyagent.org/downloads/v0.51.0/opa_linux_amd64_static
  chmod 755 opa
  mv opa ~/.local/bin
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; https://www.openpolicyagent.org/docs/v0.11.0/get-started/
  (use-package rego-mode
    :ensure t
    :custom
    (rego-repl-executable "~/.local/bin/opa")
    (rego-opa-command "~/.local/bin/opa"))
#+END_SRC

* JSON
  #+BEGIN_SRC emacs-lisp
  (use-package json-mode)
  #+END_SRC


* Web
** Enable =web-mode=
So much better than =html-mode=
#+BEGIN_SRC emacs-lisp
(use-package web-mode
  :mode "\\.phtml\\'"
  :mode "\\.volt\\'"
  :mode "\\.html\\'")
#+END_SRC

** Enable =emmet-mode=
Adding the necessary hooks
#+BEGIN_SRC emacs-lisp
  (use-package emmet-mode
    :config
    (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
    (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
    )
#+END_SRC

* SQL
** Always make PostgreSQL the default product
#+BEGIN_SRC emacs-lisp
  (require 'sql)
  (sql-set-product "postgres")
#+END_SRC
** Enable =sqlup-mode=
#+BEGIN_SRC emacs-lisp
(use-package sqlup-mode
   :config (add-hook 'sql-mode-hook 'sqlup-mode))
#+END_SRC
** Enable =sql-indent=
#+BEGIN_SRC emacs-lisp
(use-package sql-indent
   :config (add-hook 'sql-mode-hook 'sqlind-minor-mode))
#+END_SRC

* PHP
** Enable =php-mode=
And a bunch of hooks with it
And set PSR-2 as coding style
#+BEGIN_SRC emacs-lisp
  (use-package php-mode
    :config
    (add-hook 'php-mode-hook 'flycheck-mode)
    (add-hook 'php-mode-hook 'electric-operator-mode)
    (add-hook 'php-mode-hook 'dumb-jump-mode)
    (add-hook 'php-mode-hook 'php-enable-psr2-coding-style))
#+END_SRC
** Enable =company-php=
#+BEGIN_SRC emacs-lisp
  (use-package company-php
    :config
    (add-hook 'php-mode-hook 'company-mode)
    (add-hook 'php-mode-hook '(lambda ()
                                (if (not (member 'php-mode company-dabbrev-code-modes))
                                    (add-to-list 'company-dabbrev-code-modes 'php-mode)))))
#+END_SRC
** Enable =php-eldoc=
#+BEGIN_SRC emacs-lisp
  (setq auto-complete-mode nil)
  (use-package php-eldoc
    :diminish eldoc-mode
    :config (add-hook 'php-mode-hook 'php-eldoc-enable))
#+END_SRC

* Javascript and Typescript
This is a basic configuration for the TypeScript language so that =.ts= files activate =typescript-mode= when opened.
We're also adding a hook to =typescript-mode-hook= to call =lsp-deferred= so that we activate =lsp-mode= to get LSP features
every time we edit TypeScript code.

#+BEGIN_SRC emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))
#+END_SRC

*Important note!*  For =lsp-mode= to work with TypeScript (and JavaScript) you will need to install a language server on your machine.  If you have Node.js installed, the easiest way to do that is by running the following command:

#+BEGIN_SRC shell :tangle no
npm install -g typescript-language-server typescript
#+END_SRC

This will install the [[https://github.com/theia-ide/typescript-language-server][typescript-language-server]] and the TypeScript compiler package.

* Go
A lot of the config is based on gocode, godef, goimports and gotags
packages that you should install separately.
#+BEGIN_SRC bash :tangle no
#   go get -u github.com/nsf/gocode
#   go get -u github.com/rogpeppe/godef
#   go get -u golang.org/x/tools/cmd/goimports
#   go get -u github.com/jstemmer/gotags
#   go get github.com/matryer/moq
#+END_SRC

** Enable =go-mode=
Absolutely necessary if working in Go
#+BEGIN_SRC emacs-lisp
  (use-package go-mode
    :config
    (add-hook 'before-save-hook #'gofmt-before-save)
    (add-hook 'go-mode-hook 'flycheck-mode)
    (add-hook 'go-mode-hook 'dumb-jump-mode)
    (setq go-packages-function 'go-packages-go-list))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t)
    :hook
    ((go-mode) . lsp))


  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-doc-enable t))

  ;; To set the garbage collection threshold to high (100 MB) since LSP client-server communication generates a lot of output/garbage
  (setq gc-cons-threshold 100000000)
  ;; To increase the amount of data Emacs reads from a process
  (setq read-process-output-max (* 1024 1024))
#+END_SRC

* Python
** Setup =python-mode and lsp-pyright=
Need to install IPython first with =pip install ipython=.
Assuming that it would be at least IPython 5 so ask for =simple-prompt=.
#+BEGIN_SRC emacs-lisp
  (add-hook 'python-mode-hook 'electric-operator-mode)
  (setq python-shell-interpreter "ipython"
        python-shell-interpreter-args "--simple-prompt -i")


  ;; ;; You need to install pyright in the system first =pip install pyright=, for Mac you might want on install it with `npm` =sudo npm install -g pyright=
  ;; (use-package lsp-pyright
  ;;   :ensure t
  ;;   :hook (python-mode . (lambda ()
  ;;                          (require 'lsp-pyright)
  ;;                          (lsp-deferred)))
  ;;   :custom
  ;;   (python-shell-interpreter "python3"))  ; or lsp-deferred
  (use-package elpy
    :ensure t
    :init
    (elpy-enable))
#+END_SRC

* Rust
