config.el
    :config  (setq eshell-visual-commands
             '("less" "tmux" "htop" "top" "bash" "zsh" "fish"))

             (setq eshell-visual-subcommands
             '(("git" "log" "l" "diff" "show")))

             ;; Prompt with a bit of help from http://www.emacswiki.org/emacs/EshellPrompt
             (defmacro with-face (str &rest properties)
             `(propertize ,str 'face (list ,@properties)))

             (defun eshell/abbr-pwd ()
                (let ((home (getenv "HOME"))
                    (path (eshell/pwd)))
                (cond
                    ((string-equal home path) "~")
                    ((f-ancestor-of? home path) (concat "~/" (f-relative path home)))
                    (path))))

             (defun eshell/my-prompt ()
                 (let ((header-bg "#161616"))
                    (concat
                        (with-face (eshell/abbr-pwd) :foreground "#008700")
                    (if (= (user-uid) 0)
                        (with-face "#" :foreground "red")
                        (with-face "$" :foreground "#2345ba"))
                        " ")))
             (setq eshell-prompt-function 'eshell/my-prompt)
             (setq eshell-highlight-prompt nil)
             (setq eshell-prompt-regexp "^[^#$\n]+[#$] ")
             (setq eshell-cmpl-cycle-completions nil))
(use-package kubernetes
  :ensure t
  :commands (kubernetes-overview)
  :config
  (setq kubernetes-poll-frequency 3600
        kubernetes-redraw-frequency 3600))
  (use-package terraform-mode
    :config
    (defun my-terraform-mode-init ()
      if you want to use outline-minor-mode
      (outline-minor-mode 1))

    (add-hook 'terraform-mode-hook 'my-terraform-mode-init))

  ;; terraform-ls is requered
  ;; https://github.com/hashicorp/terraform-ls
  (use-package lsp-mode
    :ensure t
    :hook (terraform-mode . lsp-deferred)
    :commands (lsp lsp-deferred)
    :custom
    (lsp-disabled-clients '(tfls))
    (lsp-terraform-ls-prefill-required-fields t)
    (lsp-terraform-ls-enable-show-reference t)
    (lsp-semantic-tokens-enable t)
    (lsp-semantic-tokens-honor-refresh-requests t)
    (lsp-enable-links t))

  (use-package dockerfile-mode
    :mode "Dockerfile\\'")
  (use-package docker-compose-mode
    :mode "docker-compose\\'")
  ;; https://www.openpolicyagent.org/docs/v0.11.0/get-started/
  (use-package rego-mode
    :ensure t
    :custom
    (rego-repl-executable "~/.local/bin/opa")
    (rego-opa-command "~/.local/bin/opa"))
  (use-package json-mode)
(use-package web-mode
  :mode "\\.phtml\\'"
  :mode "\\.volt\\'"
  :mode "\\.html\\'")
  (use-package emmet-mode
    :config
    (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
    (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
    )
  (require 'sql)
  (sql-set-product "postgres")
(use-package sqlup-mode
   :config (add-hook 'sql-mode-hook 'sqlup-mode))
(use-package sql-indent
   :config (add-hook 'sql-mode-hook 'sqlind-minor-mode))
  (use-package php-mode
    :config
    (add-hook 'php-mode-hook 'flycheck-mode)
    (add-hook 'php-mode-hook 'electric-operator-mode)
    (add-hook 'php-mode-hook 'dumb-jump-mode)
    (add-hook 'php-mode-hook 'php-enable-psr2-coding-style))
  (use-package company-php
    :config
    (add-hook 'php-mode-hook 'company-mode)
    (add-hook 'php-mode-hook '(lambda ()
                                (if (not (member 'php-mode company-dabbrev-code-modes))
                                    (add-to-list 'company-dabbrev-code-modes 'php-mode)))))
  (setq auto-complete-mode nil)
  (use-package php-eldoc
    :diminish eldoc-mode
    :config (add-hook 'php-mode-hook 'php-eldoc-enable))
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))
  (use-package go-mode
    :config
    (add-hook 'before-save-hook #'gofmt-before-save)
    (add-hook 'go-mode-hook 'flycheck-mode)
    (add-hook 'go-mode-hook 'dumb-jump-mode)
    (setq go-packages-function 'go-packages-go-list))
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t)
    :hook
    ((go-mode) . lsp))


  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-doc-enable t))

  ;; To set the garbage collection threshold to high (100 MB) since LSP client-server communication generates a lot of output/garbage
  (setq gc-cons-threshold 100000000)
  ;; To increase the amount of data Emacs reads from a process
  (setq read-process-output-max (* 1024 1024))
  (add-hook 'python-mode-hook 'electric-operator-mode)
  (setq python-shell-interpreter "ipython"
        python-shell-interpreter-args "--simple-prompt -i")


  ;; ;; You need to install pyright in the system first =pip install pyright=, for Mac you might want on install it with `npm` =sudo npm install -g pyright=
  ;; (use-package lsp-pyright
  ;;   :ensure t
  ;;   :hook (python-mode . (lambda ()
  ;;                          (require 'lsp-pyright)
  ;;                          (lsp-deferred)))
  ;;   :custom
  ;;   (python-shell-interpreter "python3"))  ; or lsp-deferred
  (use-package elpy
    :ensure t
    :init
    (elpy-enable))
