config.el
    ;; (use-package rustic
    ;;   :ensure
    ;;   :bind (:map rustic-mode-map
    ;; 		("M-j" . lsp-ui-imenu)
    ;; 		("M-?" . lsp-find-references)
    ;; 		("C-c C-c l" . flycheck-list-errors)
    ;; 		("C-c C-c a" . lsp-execute-code-action)
    ;; 		("C-c C-c r" . lsp-rename)
    ;; 		("C-c C-c q" . lsp-workspace-restart)
    ;; 		("C-c C-c Q" . lsp-workspace-shutdown)
    ;; 		("C-c C-c s" . lsp-rust-analyzer-status))
    ;;   :config
    ;;   ;; uncomment for less flashiness
    ;;   ;; (setq lsp-eldoc-hook nil)
    ;;   ;; (setq lsp-enable-symbol-highlighting nil)
    ;;   ;; (setq lsp-signature-auto-activate nil)

    ;;   ;; comment to disable rustfmt on save
    ;;   (setq rustic-format-on-save t)
    ;;   (add-hook 'rustic-mode-hook 'rk/rustic-mode-hook))

    ;; (defun rk/rustic-mode-hook ()
    ;;   ;; so that run C-c C-c C-r works without having to confirm, but don't try to
    ;;   ;; save rust buffers that are not file visiting. Once
    ;;   ;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
    ;;   ;; no longer be necessary.
    ;;   (when buffer-file-name
    ;;     (setq-local buffer-save-without-query t))
    ;;   (add-hook 'before-save-hook 'lsp-format-buffer nil t))


  (use-package yasnippet
    :ensure t
    :hook ((lsp-mode . yas-minor-mode)))


  (use-package lsp-mode
    :ensure
    :commands lsp
    :custom
    ;; what to use when checking on-save. "check" is default, I prefer clippy
    (lsp-rust-analyzer-cargo-watch-command "clippy")
    (lsp-eldoc-render-all t)
    (lsp-idle-delay 0.6)
    ;; enable / disable the hints as you prefer:
    (lsp-inlay-hint-enable t)
    ;; These are optional configurations. See https://emacs-lsp.github.io/lsp-mode/page/lsp-rust-analyzer/#lsp-rust-analyzer-display-chaining-hints for a full list
    (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
    (lsp-rust-analyzer-display-chaining-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names t)
    (lsp-rust-analyzer-display-closure-return-type-hints t)
    (lsp-rust-analyzer-display-parameter-hints t)
    (lsp-rust-analyzer-display-reborrow-hints t)
    :config
    (add-hook 'lsp-mode-hook 'lsp-ui-mode))

  (use-package lsp-ui
    :ensure
    :commands lsp-ui-mode
    :custom
    (lsp-ui-peek-always-show t)
    (lsp-ui-sideline-show-hover t)
    (lsp-ui-doc-enable nil))

  (use-package rust-mode
    :config (autoload 'rust-mode "rust-mode" nil t)
    (add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-mode))
    (add-hook 'rust-mode-hook #'lsp))

    ;; JAVA 17+ is required to be installed for jdtls
    ;; https://github.com/eruizc-dev/jdtls-launcher
    (use-package lsp-java :config
      (add-hook 'java-mode-hook 'lsp))
   (use-package kotlin-mode)
   (use-package ob-kotlin)
   (require 'ob-kotlin)
  ;; (use-package scala-mode
  ;;   :interpreter ("scala" . scala-mode))
   (use-package clojure-mode
     :init
     (add-hook 'clojure-mode-hook 'lsp)
     (add-hook 'clojurescript-mode-hook 'lsp)
     (add-hook 'clojurec-mode-hook 'lsp))

  (when (cl-find-if-not #'package-installed-p package-selected-packages)
    (package-refresh-contents)
    (mapc #'package-install package-selected-packages))

  ;; (use-package cider)
  ;; (use-package clojure-lsp
  ;;   :ensure t
  ;;   :hook (clojure-mode . lsp-deferred)
  ;;   :commands (lsp lsp-deferred)
  ;;   :custom
  ;;   (setq lsp-clojure-custom-server-command '("bash" "-c" "/usr/local/bin/clojure-lsp"))
  ;;   (gc-cons-threshold (* 100 1024 1024))
  ;;   (read-process-output-max (* 1024 1024))
  ;;   (treemacs-space-between-root-nodes nil)
  ;;   (company-minimum-prefix-length 1)
  ;;   (lsp-enable-indentation nil) ; uncomment to use cider indentation instead of lsp
  ;;   (lsp-enable-completion-at-point nil)) ; uncomment to use cider completion instead of lsp
